; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_45)

(:domain logistics)

(:objects
	obj0 obj3 obj7 - airport
	obj1 obj4 obj8 - city
	obj2 obj5 obj6 obj18 obj19 obj20 obj21 obj22 - location
	obj9 obj10 obj11 obj12 - truck
	obj13 obj14 obj15 obj16 - package
	obj17 - airplane
)

(:init
	(at obj9 obj3)
	(at obj10 obj7)
	(at obj11 obj0)
	(at obj12 obj7)
	(at obj13 obj7)
	(at obj14 obj0)
	(at obj15 obj3)
	(at obj16 obj0)
	(at obj17 obj3)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj4)
	(in-city obj5 obj1)
	(in-city obj6 obj1)
	(in-city obj7 obj8)
	(in-city obj18 obj4)
	(in-city obj19 obj8)
	(in-city obj20 obj4)
	(in-city obj21 obj4)
	(in-city obj22 obj4)
)

(:goal (and
	(at obj13 obj22)
	(at obj14 obj7)
	(at obj15 obj5)
	(at obj16 obj19)
))
)

; plan
1. (drive obj10 obj7 obj19)
   deleted: (at obj10 obj7)
   added: (at obj10 obj19)
   goals met: 0 of 4
2. (drive obj11 obj0 obj5)
   deleted: (at obj11 obj0)
   added: (at obj11 obj5)
   goals met: 0 of 4
3. (drive obj12 obj7 obj19)
   deleted: (at obj12 obj7)
   added: (at obj12 obj19)
   goals met: 0 of 4
4. (drive obj9 obj3 obj18)
   deleted: (at obj9 obj3)
   added: (at obj9 obj18)
   goals met: 0 of 4
5. (load obj17 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj17)
   goals met: 0 of 4
6. (fly obj17 obj3 obj0)
   deleted: (at obj17 obj3)
   added: (at obj17 obj0)
   goals met: 0 of 4
7. (drive obj10 obj19 obj7)
   deleted: (at obj10 obj19)
   added: (at obj10 obj7)
   goals met: 0 of 4
8. (drive obj11 obj5 obj2)
   deleted: (at obj11 obj5)
   added: (at obj11 obj2)
   goals met: 0 of 4
9. (drive obj9 obj18 obj21)
   deleted: (at obj9 obj18)
   added: (at obj9 obj21)
   goals met: 0 of 4
10. (load obj17 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj17)
   goals met: 0 of 4
11. (load obj17 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj17)
   goals met: 0 of 4
12. (fly obj17 obj0 obj7)
   deleted: (at obj17 obj0)
   added: (at obj17 obj7)
   goals met: 0 of 4
13. (drive obj12 obj19 obj7)
   deleted: (at obj12 obj19)
   added: (at obj12 obj7)
   goals met: 0 of 4
14. (drive obj9 obj21 obj22)
   deleted: (at obj9 obj21)
   added: (at obj9 obj22)
   goals met: 0 of 4
15. (load obj17 obj13 obj7)
   deleted: (at obj13 obj7)
   added: (in obj13 obj17)
   goals met: 0 of 4
16. (fly obj17 obj7 obj0)
   deleted: (at obj17 obj7)
   added: (at obj17 obj0)
   goals met: 0 of 4
17. (drive obj11 obj2 obj6)
   deleted: (at obj11 obj2)
   added: (at obj11 obj6)
   goals met: 0 of 4
18. (drive obj9 obj22 obj20)
   deleted: (at obj9 obj22)
   added: (at obj9 obj20)
   goals met: 0 of 4
19. (drive obj10 obj7 obj19)
   deleted: (at obj10 obj7)
   added: (at obj10 obj19)
   goals met: 0 of 4
20. (drive obj11 obj6 obj2)
   deleted: (at obj11 obj6)
   added: (at obj11 obj2)
   goals met: 0 of 4
21. (drive obj9 obj20 obj22)
   deleted: (at obj9 obj20)
   added: (at obj9 obj22)
   goals met: 0 of 4
22. (fly obj17 obj0 obj3)
   deleted: (at obj17 obj0)
   added: (at obj17 obj3)
   goals met: 0 of 4
23. (drive obj11 obj2 obj6)
   deleted: (at obj11 obj2)
   added: (at obj11 obj6)
   goals met: 0 of 4
24. (drive obj9 obj22 obj20)
   deleted: (at obj9 obj22)
   added: (at obj9 obj20)
   goals met: 0 of 4
25. (unload obj17 obj13 obj3)
   deleted: (in obj13 obj17)
   added: (at obj13 obj3)
   goals met: 0 of 4
26. (fly obj17 obj3 obj7)
   deleted: (at obj17 obj3)
   added: (at obj17 obj7)
   goals met: 0 of 4
27. (drive obj11 obj6 obj0)
   deleted: (at obj11 obj6)
   added: (at obj11 obj0)
   goals met: 0 of 4
28. (drive obj12 obj7 obj19)
   deleted: (at obj12 obj7)
   added: (at obj12 obj19)
   goals met: 0 of 4
29. (drive obj9 obj20 obj22)
   deleted: (at obj9 obj20)
   added: (at obj9 obj22)
   goals met: 0 of 4
30. (unload obj17 obj16 obj7)
   deleted: (in obj16 obj17)
   added: (at obj16 obj7)
   goals met: 0 of 4
31. (fly obj17 obj7 obj0)
   deleted: (at obj17 obj7)
   added: (at obj17 obj0)
   goals met: 0 of 4
32. (drive obj10 obj19 obj7)
   deleted: (at obj10 obj19)
   added: (at obj10 obj7)
   goals met: 0 of 4
33. (drive obj9 obj22 obj3)
   deleted: (at obj9 obj22)
   added: (at obj9 obj3)
   goals met: 0 of 4
34. (unload obj17 obj15 obj0)
   deleted: (in obj15 obj17)
   added: (at obj15 obj0)
   goals met: 0 of 4
35. (drive obj12 obj19 obj7)
   deleted: (at obj12 obj19)
   added: (at obj12 obj7)
   goals met: 0 of 4
36. (fly obj17 obj0 obj7)
   deleted: (at obj17 obj0)
   added: (at obj17 obj7)
   goals met: 0 of 4
37. (load obj10 obj16 obj7)
   deleted: (at obj16 obj7)
   added: (in obj16 obj10)
   goals met: 0 of 4
38. (load obj11 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj11)
   goals met: 0 of 4
39. (load obj9 obj13 obj3)
   deleted: (at obj13 obj3)
   added: (in obj13 obj9)
   goals met: 0 of 4
40. (drive obj10 obj7 obj19)
   deleted: (at obj10 obj7)
   added: (at obj10 obj19)
   goals met: 0 of 4
41. (drive obj11 obj0 obj5)
   deleted: (at obj11 obj0)
   added: (at obj11 obj5)
   goals met: 0 of 4
42. (drive obj9 obj3 obj22)
   deleted: (at obj9 obj3)
   added: (at obj9 obj22)
   goals met: 0 of 4
43. (drive obj12 obj7 obj19)
   deleted: (at obj12 obj7)
   added: (at obj12 obj19)
   goals met: 0 of 4
44. (unload obj10 obj16 obj19)
   deleted: (in obj16 obj10)
   added: (at obj16 obj19)
   goals met: 1 of 4
45. (unload obj11 obj15 obj5)
   deleted: (in obj15 obj11)
   added: (at obj15 obj5)
   goals met: 2 of 4
46. (unload obj17 obj14 obj7)
   deleted: (in obj14 obj17)
   added: (at obj14 obj7)
   goals met: 3 of 4
47. (unload obj9 obj13 obj22)
   deleted: (in obj13 obj9)
   added: (at obj13 obj22)
   goals met: 4 of 4
